const 水 = ["壬", "癸", "子", "亥"];
        const 火 = ["丙", "丁", "午", "巳"];
        const 金 = ["庚", "辛", "申", "酉"];
        const 木 = ["甲", "乙", "寅", "卯"];
        const 土 = ["戊", "己", "辰", "戌", "丑", "未"];

        const 陽 = ["甲", "丙", "戊", "庚", "壬", "亥", "寅", "辰", "巳", "申", "戌"];
        const 陰 = ["乙", "丁", "己", "辛", "癸", "丑", "卯", "午", "未", "酉", "子"];

        const five_elements = ["水", "火", "金", "木", "土"];
        const relations = {
            "水" : ["同我者", "我剋者", "生我者", "我生者", "剋我者"], 
            "火" : ["剋我者", "同我者", "我剋者", "生我者", "我生者"], 
            "金" : ["我生者", "剋我者", "同我者", "我剋者", "生我者"], 
            "木" : ["生我者", "我生者", "剋我者", "同我者", "我剋者"], 
            "土" : ["我剋者", "生我者", "我生者", "剋我者", "同我者"]
        }; 
        const ten_gods = ["比肩", "劫財", "七殺", "正官", "偏印", "正印", "食神", "傷官", "偏財", "正財"];

        const tenkan_order = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
        const deizi_order = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];

        const monthNames = ["Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"];

        const yuanYunOptions = [
            { year: "1564", stem: "甲", branch: "寅" },
            { year: "1624", stem: "乙", branch: "卯" },
            { year: "1684", stem: "丙", branch: "辰" },
            { year: "1744", stem: "丁", branch: "巳" },
            { year: "1804", stem: "戊", branch: "午" },
            { year: "1864", stem: "己", branch: "未" }, 
            { year: "1924", stem: "庚", branch: "申" },
            { year: "1984", stem: "辛", branch: "酉" },
            { year: "2044", stem: "壬", branch: "戌" }
        ];

        const tenkan_deizi_rel = {
            "木": ["沐浴","冠帶","臨官","帝旺","衰","病","死","墓庫","絕","胎","養","長生"], 
            "火": ["胎","養","長生","沐浴","冠帶","臨官","帝旺","衰","病","死","墓庫","絕"],
            "土": ["胎","養","長生","沐浴","冠帶","臨官","帝旺","衰","病","死","墓庫","絕"],
            "金": ["死","墓庫","絕","胎","養","長生","沐浴","冠帶","臨官","帝旺","衰","病"],
            "水": ["帝旺","衰","病","死","墓庫","絕","胎","養","長生","沐浴","冠帶","臨官"]
        };

        const deizi_hidden_tenkan = {
            "寅" : ["甲", "丙", "戊"],
            "卯" : ["乙"],
            "辰" : ["戊", "乙", "癸"],
            "巳" : ["丙", "戊", "庚"],
            "午" : ["丁", "己" ],
            "未" : ["己", "丁", "乙"], 
            "申" : ["庚", "壬", "戊"],
            "酉" : ["辛"],
            "戌" : ["戊", "辛", "丁"], 
            "亥" : ["壬", "甲"],
            "子" : ["癸"],
            "丑" : ["己", "癸", "辛"]
        };

        const tenkan_relationships = {
            "合": {
                "土": ["甲", "己"], 
                "金": ["乙", "庚"], 
                "水": ["丙", "辛"],
                "木": ["丁", "壬"],
                "火": ["戊", "癸"]
            },
            "沖": {
                "1": ["甲", "庚"], 
                "2": ["乙", "辛"], 
                "3": ["丙", "壬"],
                "4": ["丁", "癸"], 
                "5": ["戊", "甲"], 
                "6": ["己", "乙"], 
                "7": ["庚", "丙"],
                "8": ["辛", "丁"], 
                "9": ["壬", "戊"], 
                "10": ["癸", "己"]
            }
        };

        const 三合 = { 
            "水" : ["申", "子", "辰"],
            "金" : ["巳", "酉", "丑"],
            "火" : ["寅", "午", "戌"],
            "木" : ["亥", "卯", "未"] 
        };

        const 三會 = { 
            "水" : ["亥", "子", "丑"],
            "金" : ["申", "酉", "戌"],
            "火" : ["巳", "午", "未"],
            "木" : ["寅", "卯", "辰"] 
        };

        const 三刑 = {
            "恃勢之刑" : ["未", "丑", "戌"],
            "無恩之刑" : ["申", "寅", "巳"]
        };

        const 無禮之刑 = ["子", "卯"];
        const 自刑 = ["辰", "午", "酉", "亥"];

        const six_rel = {
            "合": { 
                "土": ["子", "丑"],
                "木": ["寅", "亥"],
                "火": ["卯", "戌"],
                "金": ["酉", "辰"],
                "水": ["巳", "申"],
                "火土": ["午", "未"],
            }, 
            "沖": { 
                "0": ["子", "午"],
                "1": ["丑", "未"],
                "2": ["寅", "申"],
                "3": ["卯", "酉"],
                "4": ["辰", "戌"],
                "5": ["巳", "亥"], 
            } 
        };

        const punishMap = {
            "戌": "未", "丑": "戌", "未": "丑",
            "寅": "巳", "巳": "申", "申": "寅"
        };

        // 1. Program Data Dictionaries 
        
        // 1. Program Data Dictionaries 
        // Time Stem / Hour Branch order:
        // ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

        const minggongBranchDictAfter = {
            "冬至_大寒": ["辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳"],
            "大寒_雨水": ["卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰"],
            "雨水_春分": ["寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯"],
            "春分_谷雨": ["丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅"],
            "谷雨_小满": ["子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑"],
            "小满_夏至": ["亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子"],
            "夏至_大暑": ["戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥"],
            "大暑_处暑": ["酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌"],
            "处暑_秋分": ["申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉"],
            "秋分_霜降": ["未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申"],
            "霜降_小雪": ["午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未"],
            "小雪_冬至": ["巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午"],
        };
        
        const minggongBranchDictBefore = {
            "冬至_大寒": ["巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午"],
            "大寒_雨水": ["辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳"],
            "雨水_春分": ["卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰"],
            "春分_谷雨": ["寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯"],
            "谷雨_小满": ["丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅"],
            "小满_夏至": ["子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑"],
            "夏至_大暑": ["亥", "戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子"],
            "大暑_处暑": ["戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥"],
            "处暑_秋分": ["酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌"],
            "秋分_霜降": ["申", "未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉"],
            "霜降_小雪": ["未", "午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申"],
            "小雪_冬至": ["午", "巳", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未"],
        };

        const zhongQiIntervalKeys = [
            "冬至_大寒", "大寒_雨水", "雨水_春分", "春分_谷雨",
            "谷雨_小满", "小满_夏至", "夏至_大暑", "大暑_处暑",
            "处暑_秋分", "秋分_霜降", "霜降_小雪", "小雪_冬至"
        ]; 

        const 五虎遁歌訣 = {
        "甲": { "寅": "丙", "卯": "丁", "辰": "戊", "巳": "己", "午": "庚", "未": "辛", "申": "壬", "酉": "癸", "戌": "甲", "亥": "乙", "子": "丙", "丑": "丁" },
        "乙": { "寅": "戊", "卯": "己", "辰": "庚", "巳": "辛", "午": "壬", "未": "癸", "申": "甲", "酉": "乙", "戌": "丙", "亥": "丁", "子": "戊", "丑": "己" },
        "丙": { "寅": "庚", "卯": "辛", "辰": "壬", "巳": "癸", "午": "甲", "未": "乙", "申": "丙", "酉": "丁", "戌": "戊", "亥": "己", "子": "庚", "丑": "辛" },
        "丁": { "寅": "壬", "卯": "癸", "辰": "甲", "巳": "乙", "午": "丙", "未": "丁", "申": "戊", "酉": "己", "戌": "庚", "亥": "辛", "子": "壬", "丑": "癸" },
        "戊": { "寅": "甲", "卯": "乙", "辰": "丙", "巳": "丁", "午": "戊", "未": "己", "申": "庚", "酉": "辛", "戌": "壬", "亥": "癸", "子": "甲", "丑": "乙" },
        "己": { "寅": "丙", "卯": "丁", "辰": "戊", "巳": "己", "午": "庚", "未": "辛", "申": "壬", "酉": "癸", "戌": "甲", "亥": "乙", "子": "丙", "丑": "丁" },
        "庚": { "寅": "戊", "卯": "己", "辰": "庚", "巳": "辛", "午": "壬", "未": "癸", "申": "甲", "酉": "乙", "戌": "丙", "亥": "丁", "子": "戊", "丑": "己" },
        "辛": { "寅": "庚", "卯": "辛", "辰": "壬", "巳": "癸", "午": "甲", "未": "乙", "申": "丙", "酉": "丁", "戌": "戊", "亥": "己", "子": "庚", "丑": "辛" },
        "壬": { "寅": "壬", "卯": "癸", "辰": "甲", "巳": "乙", "午": "丙", "未": "丁", "申": "戊", "酉": "己", "戌": "庚", "亥": "辛", "子": "壬", "丑": "癸" },
        "癸": { "寅": "甲", "卯": "乙", "辰": "丙", "巳": "丁", "午": "戊", "未": "己", "申": "庚", "酉": "辛", "戌": "壬", "亥": "癸", "子": "甲", "丑": "乙" }
        };

        const xingMap = {
            // 恃勢之刑
            "未": ["丑"], 
            "丑": ["戌"], 
            "戌": ["未"], 
            
            // 無恩之刑
            "巳": ["申"], 
            "申": ["寅"], 
            "寅": ["巳"], 
            
            // 無禮之刑 (both ways)
            "子": ["卯"], 
            "卯": ["子"],               
            
            // 自刑 (points to other instances of itself)
            "辰": ["辰"], 
            "午": ["午"], 
            "酉": ["酉"], 
            "亥": ["亥"] 
        };